## Moodle Database: Educational Data Log Analysis 
The Moodle LMS  is a free and open-source learning management system written in PHP and distributed under the GNU General Public License. It is used for blended learning, distance education, flipped classroom and other e-learning projects in schools, universities, workplaces and other sectors. With customizable management features, it is used to create private websites with online courses for educators and trainers to achieve learning goals. Moodle allows for extending and tailoring learning environments using community-sourced plugins .

In this notebokk we are going to explore the 10 Academy Moodle logs stored in the database together with many other relevant tables.

# Table of content
1.  Installing the required libraries 
2.  Importing the required libraries 
3.  Moodle database understanding  
4. Data Extraction Transformation and Loading (ETL)

### Installing the necessary libraries

In [ ]:
#!pip install ipython-sql
#!pip install sqlalchemy
#!pip install psycopg2

### Importing necessary libraries

In [29]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import psycopg2
import logging
from IPython.display import display

In [4]:
#allowing connection to the database
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
#ipython-sql
%sql postgresql://bessy:Streetdance53@localhost/moodle

In [6]:
#sqlalchemy
engine = create_engine('postgresql://bessy:Streetdance53@localhost/moodle')

### Moodle database Understanding.
Now, let's have a glance of how some of the tables look like.We will consider the following tables;
`mdl_logstore_standard_log`,
`mdl_context`,
`mdl_user`,
`mdl_course`,
`mdl_modules `,
`mdl_course_modules`,
`mdl_course_modules_completion`, 
`mdl_grade_items`,
`mdl_grade_grades`,
`mdl_grade_categories`,
`mdl_grade_items_history`,
`mdl_grade_grades_history`,
`mdl_grade_categories_history`,
`mdl_forum`,
`mdl_forum_discussions`,
`mdl_forum_posts`.

`Table:mdl_logstore_standard_log`

In [7]:
%%sql
SELECT *FROM mdl_logstore_standard_log LIMIT 3;

 * postgresql://bessy:***@localhost/moodle
3 rows affected.

[(1, '\\core\\event\\course_viewed', 'core', 'viewed', 'course', None, None, 'r', 2, 2, 50, 1, 0, 1, None, 0, 'N;', 1548311114, 'web', '105.233.48.139', None),
 (2, '\\core\\event\\user_loggedin', 'core', 'loggedin', 'user', 'user', 2, 'r', 0, 1, 10, 0, 2, 0, None, 0, 'a:1:{s:8:"username";s:5:"admin";}', 1548311148, 'web', '105.233.48.139', None),
 (3, '\\core\\event\\dashboard_viewed', 'core', 'viewed', 'dashboard', None, None, 'r', 0, 5, 30, 2, 2, 0, 2, 0, 'N;', 1548311179, 'web', '105.233.48.139', None)]

`Table: mdl_context`

In [8]:
%%sql
SELECT * FROM mdl_context LIMIT 3;

 * postgresql://bessy:***@localhost/moodle
3 rows affected.

[(1, 10, 0, '/1', 1, 0),
 (496, 70, 226, '/1/72/430/496', 4, 0),
 (2, 50, 1, '/1/2', 2, 0)]

`mdl_course`

In [9]:
%%sql
SELECT * FROM mdl_course LIMIT 3;

 * postgresql://bessy:***@localhost/moodle
3 rows affected.

[(7, 6, 60002, 'FDP Design -WordPress', 'FDP WordPress', '', '<p><img src="@@PLUGINFILE@@/WordPress.svg.png" alt="WordPress website" role="presentation" class="img-responsive atto_image_button_text-bottom" heigh ... (604 characters truncated) ... e. You are free to use, distribute and modify it, including for commercial purposes, provided you acknowledge the source and share-alike.<br><br></p>', 1, 'topics', 1, 5, 1528741800, 1560277800, 0, 2097152, 0, 0, 1, 1, 0, 0, 0, '', '', '', 1528706177, 1548697122, 0, 1, 0, 1561503107),
 (10, 1, 30001, 'How to design and facilitate an online course', 'Design eCourse ', '', '<p dir="ltr"><span>After completing this course you will be able to plan an e-learning course together with exercises and elements of online teaching ... (11 characters truncated) ... using a variety of tools and teaching methods selected specifically to meet your goals.</span></p>\r\n<p dir="ltr"></p>\r\n<p><span>&nbsp;</span></p>', 1, 'topics', 1, 5, 1546383600, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 'en', '', 'boost', 1374053678, 1562773717, 0, 0, 0, 1562773718),
 (50, 10, 80001, 'How data can impact development', 'Data for Development', '', '<p>This course is part of the Changemaking track, which looks to give context on how Data Science can impact development and also to give skills on h ... (547 characters truncated) ... ples of Data used in Development (to be added)</li><li>Places to find new development challenges that data could solve (to be added)</li></ul><p></p>', 1, 'topics', 1, 1, 1562277600, 0, 0, 5242880, 0, 1, 1, 1, 0, 0, 0, 'en', '', 'boost', 1562232960, 1562307278, 0, 1, 0, 1563791465)]

`mdl_user`

In [10]:
%%sql
SELECT * FROM mdl_user LIMIT 3;

 * postgresql://bessy:***@localhost/moodle
3 rows affected.

[(1, 1, 0, 0, 0, '', 'Germany', 'en', 0, 0, 0, 0, '', 'Male', 'DE'),
 (20, 1, 0, 0, 0, '', 'Germany', 'en', 1549745767, 1562935333, 1549745767, 1562935333, '197.215.32.111', 'Male', 'DE'),
 (15, 1, 0, 0, 0, '', 'Germany', 'en', 1549633236, 1563537002, 1563469481, 1563537002, '41.184.239.200', 'Male', 'DE')]

`mdl_modules`

In [11]:
%%sql
SELECT * FROM mdl_modules LIMIT 3;

 * postgresql://bessy:***@localhost/moodle
3 rows affected.

[(2, 'assignment', 60, 0, '', 0),
 (3, 'book', 0, 0, '', 1),
 (5, 'choice', 0, 0, '', 1)]

`mdl_course_modules`

In [12]:
%%sql
SELECT * FROM mdl_course_modules LIMIT 3;

 * postgresql://bessy:***@localhost/moodle
3 rows affected.

[(1, 1, 9, 1, 2, None, 1548435669, 0, 0, 1, 1, 1, 0, 0, 0, None, 0, 0, 0, None, 0),
 (23, 6, 12, 1, 17, None, 1206338932, 0, 0, 1, 1, 1, 0, 0, 0, None, 0, 0, 0, None, 0),
 (69, 8, 15, 2, 29, '', 1543620947, 0, 0, 1, 1, 1, 0, 0, 0, None, 0, 0, 0, None, 0)]

`mdl_course_modules_completion`

In [13]:
%%sql
SELECT * FROM mdl_course_modules_completion LIMIT 3

 * postgresql://bessy:***@localhost/moodle
3 rows affected.

[(5801, 224, 56, 1, 0, None, 1561988963),
 (3, 228, 3, 0, 1, None, 0),
 (36, 228, 2, 0, 1, None, 0)]

`mdl_grade_grades`

In [14]:
%%sql
SELECT * FROM mdl_grade_grades LIMIT 3

 * postgresql://bessy:***@localhost/moodle
3 rows affected.

[(2, 92, 3, None, Decimal('100.00000'), Decimal('0.00000'), None, None, None, 0, 0, 0, 0, 0, 0, None, 0, None, 0, None, None, 'unknown', None),
 (1, 93, 3, None, Decimal('10.00000'), Decimal('0.00000'), None, 3, None, 0, 0, 0, 0, 0, 0, None, 0, None, 0, None, None, 'novalue', Decimal('0.00000')),
 (51, 126, 50, None, Decimal('12.00000'), Decimal('0.00000'), None, None, Decimal('12.00000'), 0, 0, 0, 0, 0, 0, None, 0, None, 0, None, 1549723271, 'unknown', None)]

### Number of tables in the database;

In [26]:
%%sql
SELECT COUNT(*) FROM information_schema.tables

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(642,)]

### Number of records in the following tables;

In [15]:
mit = ['mdl_logstore_standard_log', 'mdl_context', 'mdl_user', 'mdl_course', 'mdl_modules' , 'mdl_course_modules', 'mdl_course_modules_completion',
       'mdl_grade_items', 'mdl_grade_grades', 'mdl_grade_categories', 'mdl_grade_items_history', 'mdl_grade_grades_history', 
       'mdl_grade_categories_history', 'mdl_forum', 'mdl_forum_discussions', 'mdl_forum_posts']

# fetches and returns number of records of a given table in a moodle database
def table_count(table):
    count = %sql SELECT COUNT(*) as {table}_count from {table}
    return count

for table in mit:
    display(table_count(table))

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(417554,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(4359,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(1052,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(15,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(26,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(290,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(4483,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(113,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(3643,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(16,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(486,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(7108,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(46,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(34,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(23,)]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(131,)]

### Number of quiz submission by time

In [16]:
%%sql
select  date_part('hour', timestamp with time zone 'epoch' + timefinish * interval '1 second') as hour, count(1)
from mdl_quiz_attempts qa
where qa.preview = 0 and qa.timefinish <> 0
group by date_part('hour', timestamp with time zone 'epoch' + timefinish * interval '1 second')
order by hour

 * postgresql://bessy:***@localhost/moodle
24 rows affected.

[(0.0, 26),
 (1.0, 23),
 (2.0, 30),
 (3.0, 29),
 (4.0, 7),
 (5.0, 14),
 (6.0, 10),
 (7.0, 18),
 (8.0, 17),
 (9.0, 34),
 (10.0, 46),
 (11.0, 69),
 (12.0, 95),
 (13.0, 89),
 (14.0, 104),
 (15.0, 90),
 (16.0, 79),
 (17.0, 69),
 (18.0, 68),
 (19.0, 70),
 (20.0, 57),
 (21.0, 55),
 (22.0, 46),
 (23.0, 54)]

In [41]:
%%sql
SELECT COUNT(id), EXTRACT(HOUR FROM to_timestamp(timecreated)) FROM mdl_logstore_standard_log WHERE action ='submitted' AND component='mod_quiz'
group by EXTRACT(HOUR FROM to_timestamp(timecreated));

 * postgresql://bessy:***@localhost/moodle
24 rows affected.

[(26, 0.0),
 (23, 1.0),
 (30, 2.0),
 (29, 3.0),
 (7, 4.0),
 (14, 5.0),
 (10, 6.0),
 (18, 7.0),
 (17, 8.0),
 (34, 9.0),
 (46, 10.0),
 (69, 11.0),
 (95, 12.0),
 (88, 13.0),
 (104, 14.0),
 (90, 15.0),
 (80, 16.0),
 (68, 17.0),
 (68, 18.0),
 (70, 19.0),
 (57, 20.0),
 (55, 21.0),
 (46, 22.0),
 (53, 23.0)]

## Monthly usage time of learners who have confirmed and are not deleted

In [42]:
%%sql
select extract(month from to_timestamp(mdl_stats_user_monthly.timeend)) as calendar_month,
    count(distinct mdl_stats_user_monthly.userid) as total_users
from mdl_stats_user_monthly
    inner join mdl_role_assignments on mdl_stats_user_monthly.userid = mdl_role_assignments.userid
    inner join mdl_context on mdl_role_assignments.contextid = mdl_context.id
where mdl_stats_user_monthly.stattype = 'activity'
    and mdl_stats_user_monthly.courseid <>1
group by extract(month from to_timestamp(mdl_stats_user_monthly.timeend))
order by extract(month from to_timestamp(mdl_stats_user_monthly.timeend))

 * postgresql://bessy:***@localhost/moodle
2 rows affected.

[(7.0, 44), (8.0, 121)]

In [68]:
%%sql 
SELECT COUNT(lastaccess - firstaccess) AS usagetime, EXTRACT (MONTH FROM to_timestamp(firstaccess)) AS month 
FROM mdl_user WHERE confirmed = 1 AND deleted = 0 GROUP BY EXTRACT (MONTH FROM to_timestamp(firstaccess))

 * postgresql://bessy:***@localhost/moodle
7 rows affected.

[(58, 3.0),
 (31, 7.0),
 (450, 1.0),
 (227, 2.0),
 (27, 6.0),
 (138, 4.0),
 (113, 5.0)]

## Count of log events per user

In [17]:
actions = ['loggedin', 'viewed', 'started', 'submitted', 'uploaded', 'updated',  'searched', 
           'answered', 'attempted', 'abandoned']

# fetch and return count of log events of an action per user
def  event_count(action):
    count = %sql SELECT userid, COUNT(action) AS {action}_count FROM mdl_logstore_standard_log WHERE action='{action}' GROUP BY userid limit 5
    return count

for action in actions:
    display(event_count(action))

 * postgresql://bessy:***@localhost/moodle
5 rows affected.

[(1, 1), (2, 169), (3, 107), (5, 54), (7, 3)]

 * postgresql://bessy:***@localhost/moodle
5 rows affected.

[(0, 5305), (1, 2), (2, 2492), (3, 4041), (5, 694)]

 * postgresql://bessy:***@localhost/moodle
5 rows affected.

[(2, 14), (3, 17), (5, 11), (7, 2), (8, 1)]

 * postgresql://bessy:***@localhost/moodle
5 rows affected.

[(2, 21), (3, 2), (5, 5), (9, 8), (16, 1)]

 * postgresql://bessy:***@localhost/moodle
5 rows affected.

[(2, 21), (3, 6), (5, 1), (42, 1), (44, 1)]

 * postgresql://bessy:***@localhost/moodle
5 rows affected.

[(0, 649), (2, 2551), (3, 1467), (5, 19), (7, 1)]

 * postgresql://bessy:***@localhost/moodle
5 rows affected.

[(84, 2), (246, 1), (253, 1), (266, 2), (294, 1)]

 * postgresql://bessy:***@localhost/moodle
5 rows affected.

[(5, 2), (9, 4), (25, 6), (38, 1), (39, 1)]

 * postgresql://bessy:***@localhost/moodle
0 rows affected.

[]

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(2, 5)]

### python class to pull 
* Overall grade of learners 
* Number of forum posts

In [21]:
class PullGrade():
    def __init__(self):
        pass
    
    def open_db(self, **kwargs):
        # extract args, if they are not provided assign a default value
        user = kwargs.get('user', 'briodev')
        password = kwargs.get('password', '14ConnectPsq')
        db = kwargs.get('db', 'moodle')
        
        # make a connection to PostgreSQL
        # use exception to show error message if failed to connect
        try:
            params = dict(user=user, 
                         password=password,
                         host="127.0.0.1",
                         port = "5432",
                         database = db)
            proot = 'postgresql://{user}@{host}:5432/{database}'.format(**params)
            logging.info('Connecting to the PostgreSQL database... using sqlalchemy engine')
            engine = create_engine(proot)
        except (Exception, psycopg2.Error) as error:
            logging.error(r"Error while connecting to PostgreSQL {error}")
            
        return engine
    
    # fetch and return number of forum posts
    def forum_posts(self):
        count = %sql SELECT COUNT(*) from mdl_forum_posts
        return count
    
    # fetch and return overall grade of learners
    def overall_grade(self):
        overall = %sql SELECT userid, round(SUM(finalgrade)/count(*), 2) as overall_grade from mdl_grade_grades WHERE finalgrade is not null group by userid LIMIT 10
        return overall

In [24]:
db = PullGrade()
db.open_db()

Engine(postgresql://briodev@127.0.0.1:5432/moodle)

In [25]:
#Forum_posts
db.forum_posts()

 * postgresql://bessy:***@localhost/moodle
1 rows affected.

[(131,)]

In [26]:
#Overall grade.
db.overall_grade()

 * postgresql://bessy:***@localhost/moodle
10 rows affected.

[(3, Decimal('100.00')),
 (5, Decimal('57.24')),
 (7, Decimal('100.00')),
 (9, Decimal('70.67')),
 (12, Decimal('100.00')),
 (13, Decimal('100.00')),
 (14, Decimal('100.00')),
 (15, Decimal('100.00')),
 (16, Decimal('43.73')),
 (17, Decimal('100.00'))]

### Data Extraction Transformation and Loading (ETL)

In [27]:
#reading the mdl_logstore_standard_log
log_df = pd.read_sql("select * from mdl_logstore_standard_log", engine)

In [28]:
def top_x(df, percent):
    total_len = df.shape[0]
    top = int((total_len * percent)/100)
    return df.iloc[:top,]

### Login count

In [30]:
log_df_logged_in = log_df[log_df.action == 'loggedin'][['userid', 'action']]
login_by_user = log_df_logged_in.groupby('userid').count().sort_values('action', ascending=False)

In [31]:
login_by_user.columns = ["login_count"]
top_x(login_by_user, 1)

        login_count
userid
2               169
246             113
3               107
369             100
165              91
290              73

### Activity count

In [33]:
activity_log = log_df[['userid', 'action']]
activity_log_by_user = activity_log.groupby('userid').count().sort_values('action', ascending=False)

In [34]:
activity_log_by_user.columns = ['activity_count']
top_x(activity_log_by_user, 1)

        activity_count
userid
2                45023
246              13917
3                12922
917              10696
581              10533
290               8558
347               7320
0                 7257
607               6461
344               6019

In [35]:
log_in_out = log_df[(log_df.action == "loggedin") | (log_df.action == "loggedout")]

In [36]:
user_id =  log_df.userid.unique()

d_times = {}

for user in user_id:
    log_user = log_df[log_df.userid == user].sort_values('timecreated')
    
    d_time = 0 
    isLoggedIn = 0
    loggedIn_timecreated = 0
    
    for i in range(len(log_user)): 
        row = log_user.iloc[i,]
        
        row_next = log_user.iloc[i+1,] if i+1 < len(log_user) else row
        
        if(row.action == "loggedin"): 
            isLoggedIn = 1
            loggedIn_timecreated = row.timecreated

        if( (i+1 == len(log_user)) | ( (row_next.action == "loggedin") & (isLoggedIn == 1) ) ):
            d_time += row.timecreated - loggedIn_timecreated
            isLoggedIn = 0

    d_times[user] = d_time

In [37]:

dedication_time_df = pd.DataFrame({'userid':list(d_times.keys()),
                                  'dedication_time':list(d_times.values())})

In [38]:
dedication_time_df

      userid  dedication_time
0          0       1564600616
1          2         12327893
2          3          7796683
3          1               20
4          5          7493453
...      ...              ...
1044    1038       1563801728
1045    1037       1563801728
1046    1052       1563801728
1047    1051       1563801728
1048    1049       1563801728

[1049 rows x 2 columns]

In [40]:
top_x(dedication_time_df.sort_values('dedication_time', ascending=False), 35)

     userid  dedication_time
0         0       1564600616
25       -1       1564597508
951     944       1563801729
953     938       1563801729
954     937       1563801729
..      ...              ...
503     507       1563801726
504     508       1563801726
789     792       1563801726
456     460       1563801726
854     955       1563801726

[367 rows x 2 columns]

### References
*	https://docs.moodle.org/39/en/Custom_SQL_queries_report
*	https://docs.moodle.org/39/en/ad-hoc_contributed_reports
*	https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.331.667&rep=rep1&type=pdf
*	http://informatics.ue-varna.bg/conference19/Conf.proceedings_Informatics-50.years%20177-187.pdf